src/cf/InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикСтраховыхВзносовПФР_ФФОМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИПТарифыФиксированныхВзносов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ИПТарифыФиксированныхВзносов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИПТарифыФиксированныхВзносов</Name>
			<Comment>Тарифы фиксированных взносов ИП согласно ст. 430 НК РФ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единый</Name>
					<Comment>Единый тариф согласно п.1.2 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйПенсионер</Name>
					<Comment>Тариф для военных пенсионеров согласно п.1.4. ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСЭЗнаНТ</Name>
					<Comment>Тариф для участника СЭЗ в соответствии с п.1.3 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура(
		"Организация, Период",
		НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация,
		НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период);
		
	Оповестить("Запись_НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС", ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлательщикСтраховыхВзносовПФР_ФФОМСПриИзменении(Элемент)
	
	Если Не НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ПлательщикСтраховыхВзносовПФР_ФФОМС Тогда
		НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Тариф = Неопределено;
	Иначе
		НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Тариф =
			ПредопределенноеЗначение("Перечисление.ИПТарифыФиксированныхВзносов.Единый");
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.Тариф.Видимость = Форма.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.ПлательщикСтраховыхВзносовПФР_ФФОМС;
	
КонецПроцедуры

#КонецОбласти
